Revit 2027 API
EnergyAnalysisSurface.Normal Property
 The outward normal for this surface.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Normal { get; }
Public ReadOnly Property Normal As XYZ
	Get
public:
property XYZ^ Normal {
	XYZ^ get ();
}
member Normal : XYZ with get
Property Value
XYZ
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace